'''
https://blog.csdn.net/weixin_41706011/article/details/86726964
述：
问题描述

涛涛最近要负责图书馆的管理工作，需要记录下每天读者的到访情况。每位读者有一个编号，每条记录用读者的编号来表示。给出读者的来访记录，请问每一条记录中的读者是第几次出现。

输入格式
　　输入的第一行包含一个整数n，表示涛涛的记录条数。
　　第二行包含n个整数，依次表示涛涛的记录中每位读者的编号。

输出格式

　　输出一行，包含n个整数，由空格分隔，依次表示每条记录中的读者编号是第几次出现。

样例输入
5
1 2 1 1 3

样例输出  1 1 2 3 1

评测用例规模与约定　　1≤n≤1,000，读者的编号为不超过n的正整数。
————————————————
版权声明：本文为CSDN博主「SoftwareZhen」的原创文章，遵循CC 4.0 BY-SA版权协议，转载请附上原文出处链接及本声明。
原文链接：https://blog.csdn.net/weixin_41706011/java/article/details/86726964
'''

n = 5
ls = [1, 2, 1, 1, 3]
print([1].count(1))

def door(n,ls):
    return [ls[:i+1].count(e) for i,e in enumerate(ls)]

print(door(n,ls))