
import dateparser
date = "2021/11/1"
date = "Nov.1,2021"
date = "2021年11月7日"
#date = "1 de febrero de 2020" #西班牙语
date = "1er novembre 2021"    #法语
date = "7 novembre 2021"      #意大利语
date = "7 de noviembre de 2021" #西班牙语
date = "7 ноября 2021 года"  #俄语
#date = "1970, 6, 5"
print(dateparser.parse(date))

'''

水瓶座 ------ 1月21日-2月19日
双鱼座 --------- 2月20日-3月20日
白羊座 ---------- 3月21日-4月20日
金牛座 -------- 4月21日-5月21日
双子座 -------- 5月22日-6月21日
巨蟹座 -------- 6月22日-7月22日
狮子座 ------------- 7月23日-8月23日
处女座 ----------- 8月24日-9月23日
天秤座 ----------- 9月24日-10月23日
天蝎座 -------- 10月24日-11月22日
射手座 ---- 11月23日-12月21日
摩羯座 ----- 12月22日-1月20日

'''

