'''

How many ways can the sequence 1,2,3,4,5 be arranged so that no
three consecutive terms are increasing and no three consecutive
terms are decreasing?

序列1,2,3,4,5可以有多少种排列方式，使得没有三个连续项是递增的，没有三个连续
项是递减的？


在解决上题之前，我们先看一个非常经典的概率问题，仔细品两个问题之间的联系​！



你有1个骰子，同桌有6个骰子。你和同桌约定不同方式的扔法，计算谁的方式扔出下列排列组合的的可能性更大？

哪种情况更有可能？

A) 你一个骰子掷了6次，顺序正好掷出：1 2 3 4 5 6 如上图

B) 同桌一次性掷出6个骰子，恰好6个骰子向上的点数都不相同：
1 2 3 4 5 6 如上图


情况A要求每次掷出的数字都是一个特定的数字。​​
情况B要求同样的六个数字，但由于数字可以按任何顺序掷出，这种情况更有可能。
例如，掷出234561和524136都能满足将骰子重新排列成123456的要求。

'''

